app/Controllers/EventController.php

SELECT *
FROM `events`
SELECT *
FROM `rooms`
WHERE `rooms`.`id` = '1'
---
    public function index()
    {
        $eventModel = new EventModel();
        $roomModel = new RoomModel();

        // Mengambil semua data acara
        $events = $eventModel->findAll();

        // Menambahkan nama ruangan untuk setiap acara
        foreach ($events as &$event) {
            $room = $roomModel->find($event['room_id']); // Ambil data ruangan berdasarkan room_id