app/Controllers/GuestController.php

SELECT `guests`.*, `events`.`name` as `event_name`
FROM `guests`
JOIN `events` ON `events`.`id` = `guests`.`event_id`
---
    public function index()
    {
        $guestModel = new GuestModel();
        $eventModel = new EventModel();

        // Mendapatkan seluruh tamu beserta nama acara
        $guests = $guestModel->select('guests.*, events.name as event_name')
                             ->join('events', 'events.id = guests.event_id')
                             ->findAll();