app/Controllers/RoomController.php

    public function index()
    {
        $roomModel = new RoomModel();
        $rooms = $roomModel->findAll();  // Mengambil semua data room
---
SELECT *
FROM `rooms`

    public function store()
    {
        $roomModel = new RoomModel();

        // Validasi input
        $validation = \Config\Services::validation();
        if (!$this->validate([
            'name' => 'required|min_length[3]|max_length[255]',
            'location' => 'required|min_length[3]|max_length[255]',
            'capacity' => 'required|is_natural_no_zero'
        ])) {
            return redirect()->to('/room/create')->withInput()->with('errors', $validation->getErrors());
        }

        // Menyimpan data ruangan baru ke dalam tabel rooms
        $roomModel->save([
            'name' => $this->request->getVar('name'),
            'location' => $this->request->getVar('location'),
            'capacity' => $this->request->getVar('capacity')
        ]);
---
INSERT INTO `rooms` (`name`, `location`, `capacity`, `created_at`, `updated_at`) VALUES ('sas', 'asa', '1', '2025-01-15 14:14:19', '2025-01-15 14:14:19')

    public function edit($id)
    {
        $roomModel = new RoomModel();
        $room = $roomModel->find($id);  // Mengambil data ruangan berdasarkan ID
---
SELECT *
FROM `rooms`
WHERE `rooms`.`id` = '1'

    public function delete($id)
    {
        $roomModel = new RoomModel();
        $roomModel->delete($id);  // Menghapus data ruangan berdasarkan ID
---
DELETE FROM `rooms`
WHERE `id` IN ('8')